In [1]:
import pandas as pd

In [2]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [3]:
s.iloc[[0,3,1]]

서울    9904312
대구    2466052
부산    3448737
dtype: int64

In [5]:
s[['서울','대구','부산']]

서울    9904312
대구    2466052
부산    3448737
dtype: int64

In [6]:
s[['부산','인천']]

부산    3448737
인천    2890451
dtype: int64

In [7]:
s['부산':'인천']

부산    3448737
인천    2890451
dtype: int64

In [8]:
s.부산
s.인천

2890451

In [9]:
'부산' in s

True

In [11]:
for k, v in s.items():
    print(k)
    print(v)

서울
9904312
부산
3448737
인천
2890451
대구
2466052

In [12]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [13]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
              index=['대전','인천','부산','서울'])
s2

대전    1490158
인천    2632035
부산    3393191
서울    9631482
dtype: int64

In [16]:
ds=s-s2 # 시리즈 간 연산시 양쪽 모두 자료가 존재하면 계산이 수행, 어느 항쪽만 자료가 존재하면NaN, 전체 결과 자료형은 float로 변환
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [17]:
s.values-s2.values

array([ 8414154,   816702,  -502740, -7165430], dtype=int64)

In [18]:

ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [19]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [22]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [25]:
s #2010

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [26]:
s2 #2015

대전    1490158
인천    2632035
부산    3393191
서울    9631482
dtype: int64

In [27]:
ds2 = (s - s2)/s2*100
ds2[ds2.notnull()]

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [31]:
rs=s-s2

In [33]:
rs=rs[rs.notnull()]
rs

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [34]:
rs['부산']

55546.0

In [35]:
del rs['서울']

In [36]:
rs

부산     55546.0
인천    258416.0
dtype: float64

In [37]:
obj=pd.Series([4,7,-5, 3])

In [40]:
obj.array
obj.index

RangeIndex(start=0, stop=4, step=1)

In [41]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [42]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [43]:
obj2["a"]

-5

In [44]:
obj2[["c","a","d"]]

c    3
a   -5
d    4
dtype: int64

In [45]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [46]:
"b" in obj2

True

In [47]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [52]:
obj3=pd.Series(sdata)

In [53]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [57]:
pd.Series(sdata)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [58]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [59]:
obj4= pd.Series(sdata, index= states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [60]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [61]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [62]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [63]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [64]:
obj4.notnull()
obj4.notna()
pd.notnull(obj4)
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [65]:
obj4.isnull()
obj4.isna()
pd.isnull(obj4)
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [66]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [67]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [68]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [69]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [70]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [71]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [75]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [76]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [77]:
pd.Series(data)

state    [Ohio, Ohio, Ohio, Nevada, Nevada, Nevada]
year           [2000, 2001, 2002, 2001, 2002, 2003]
pop                  [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
dtype: object

In [79]:
frame=pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [80]:
# data2 = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
#         "year": [2000, 2001, 2002, 2001, 2002, 2003],
#         "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# pd.DataFrame(data2)

In [84]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [85]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [86]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [88]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [89]:
frame2.index

RangeIndex(start=0, stop=6, step=1)

In [90]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [91]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [92]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [93]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [94]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [95]:
frame2.iloc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [97]:
frame2.iloc[-1]

year       2003
state    Nevada
pop         3.2
debt        NaN
Name: 5, dtype: object

In [98]:
s.loc['서울']

9904312

In [99]:
s.iloc[0]

9904312

In [101]:
frame2["debt"]

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: debt, dtype: object

In [102]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [104]:
frame2["debt"]=16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [108]:
import numpy as np
frame2["debt"]=np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [110]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [111]:
frame2["debt"]=val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [112]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [113]:
frame2['eastern'] = [True, True, True, False, False, False]
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [114]:
frame2["state"] == "Ohio"

0     True
1     True
2     True
3    False
4    False
5    False
Name: state, dtype: bool

In [115]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [116]:
del frame2["eastern"]

In [117]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [118]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [120]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [123]:
frame3=pd.DataFrame(populations)

In [125]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [126]:
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [131]:
pd.DataFrame(populations, index=[2001, 2002,2004])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2004   NaN     NaN

In [134]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [135]:
frame3['Ohio']

2000    1.5
2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [137]:
frame3.iloc[[1,2]]

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [139]:
frame3['Ohio'][0:2]
frame3['Ohio'].head(2)

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [141]:
frame3['Ohio'].iloc[[1,2]]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [142]:
frame3['Ohio']
frame3['Ohio'].head(2)
frame3['Ohio'][0:2]
frame3['Ohio'].iloc[[0,1]]
frame3['Ohio'].iloc[0:2]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [143]:
frame3['Ohio']
frame3['Ohio'][:2]
frame3['Nevada'][:-2]

2000   NaN
Name: Nevada, dtype: float64

In [144]:
pd.DataFrame({frame3['Ohio'][:2],frame3['Nevada'][:-2]})

TypeError: unhashable type: 'Series'

In [145]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [146]:
frame3.index.name="year"

In [147]:
frame3.columns.name="state"

In [148]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [149]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [150]:
frame2.to_numpy

<bound method DataFrame.to_numpy of    year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN>

In [152]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int32

In [153]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [155]:
pd.Series([1.5, -2.5, 0],index=np.arange(1,4))

1    1.5
2   -2.5
3    0.0
dtype: float64

In [156]:
obj2=pd.Series([1.5, -2.5, 0], index=np.arange(1,4))
obj2

1    1.5
2   -2.5
3    0.0
dtype: float64

In [157]:
4 in obj2.index

False

In [159]:
3 in obj2.index

True

In [160]:
2024 in frame3.index

False

In [161]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [162]:
'utah' in frame3.columns

False

In [168]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6],index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [169]:
obj.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [170]:
obj.reindex()

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [171]:
obj.reindex(["a", "b", "c", "d", "e"])

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [172]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [173]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [174]:
obj3.reindex(np.arange(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [176]:
obj3.reindex(np.arange(6),method='ffill') 
obj3.reindex(np.arange(6),method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [177]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [178]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [179]:
states = ["Texas", "Utah", "California"]

In [182]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [184]:
frame.loc[['a','d']]

   Ohio  Texas  California
a     0      1           2
d     6      7           8

In [188]:
frame.loc[['a','d','c'],['California','Texas']]

   California  Texas
a           2      1
d           8      7
c           5      4

In [189]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [190]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [193]:
obj.drop(["d","c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [194]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [195]:
data.drop(["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [196]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [201]:
#data.drop('two')
#data.drop(columns='two')
#data.drop('two',axis=1)
data.drop('two',axis='columns')
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [202]:
data.drop('two',axis='columns', inplace=True)
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [203]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [209]:
# obj[1]
# obj[2:4]
obj.iloc[[1,3]]
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [210]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [211]:
obj1

2    1
0    2
1    3
dtype: int64

In [212]:
obj2

a    1
b    2
c    3
dtype: int64

In [215]:
obj1.iloc[0:3]
obj1.loc[1]

3

In [217]:
obj2.loc['b':'c']

b    2
c    3
dtype: int64

In [219]:
obj2.loc['b':'c']=10

In [220]:
obj2

a     1
b    10
c    10
dtype: int64

In [221]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [222]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [223]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [224]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [228]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [229]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [230]:
data[data<5]=0

In [231]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [236]:
data.iloc[1][[1,2]]

C:\Users\OH\AppData\Local\Temp\ipykernel_26868\3383153149.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data.iloc[1][[1,2]]

two      5
three    6
Name: Colorado, dtype: int32

In [237]:
data.loc['Colorado'][1:3]

two      5
three    6
Name: Colorado, dtype: int32

In [239]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [240]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [241]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [242]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [243]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [245]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [246]:
data.iloc[2]
data.iloc[2,3]
data.iloc[2,[3,0]]
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [247]:
data.iloc[[1, 2]]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11

In [248]:
data.iloc[[1,2],3]

Colorado     7
Utah        11
Name: four, dtype: int32

In [249]:
data.iloc[[1, 2],[3,0]]

          four  one
Colorado     7    0
Utah        11    8

In [250]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [253]:
data.iloc[[0,1,2]]
data[0:3]
data.loc[['Ohio', 'Colorado', 'Utah']]
data.drop('New York')

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [254]:
data.loc['Ohio':'Utah']

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [255]:
data.loc['Ohio':'Utah']

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [256]:
data.loc['Ohio':'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [257]:
data.iloc[:,:3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [258]:
data.loc['Ohio']

one      0
two      0
three    0
four     0
Name: Ohio, dtype: int32

In [259]:
data.three

Ohio         0
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [260]:
data.three>5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [261]:
data[data.three>5]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15